tsung.config.xml
<?xml version="1.0"?>
<!DOCTYPE tsung
  SYSTEM '/usr/share/tsung/tsung-1.0.dtd'>
<tsung loglevel="notice" version="1.0">
	<!-- Client side setup -->
	<clients>
		 <!-- <client host="localhost" use_controller_vm="true"/> -->
		<client cpu="7" host="loadgen1" maxusers="40000" weight="1">
			<ip value="192.168.40.11"/>
		</client>
		<!-- 
		<client cpu="7" host="loadgen2" maxusers="40000" weight="1">
			<ip value="192.168.40.12"/>
		</client>
		<client cpu="7" host="loadgen3" maxusers="40000" weight="1">
			<ip value="192.168.40.13"/>
		</client> -->
	</clients>
	<!-- Server side setup -->
	<servers>
		<server host="192.168.50.5" port="80" type="tcp"/>
	</servers>

	<!-- to start os monitoring (cpu, network, memory). Use an erlang
  agent on the remote machine or SNMP. erlang is the default -->
	<!--
	<monitoring>
		<monitor host="myserver" type="snmp"/>
	</monitoring>
	-->
	<load>
		<!-- several arrival phases can be set: for each phase, you can set
  the mean inter-arrival time between new clients and the phase
  duration -->
		<arrivalphase duration="1" phase="1" unit="minute">
			<users maxnumber="5000" arrivalrate="100" unit="second"/>
		</arrivalphase>
	</load>
	<options>
		<option name="user_agent" type="ts_http">
			<user_agent probability="80">Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.7.8) Gecko/20050513 Galeon/1.3.21</user_agent>
			<user_agent probability="20">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
		</option>
	</options>
	<!-- start a session for a http user. the probability is the
  frequency of this type os session. The sum of all session's
  probabilities must be 100 -->
	<sessions>
		<session name="http-example" probability="100" type="ts_http">
			<!-- full url with server name, this overrides the "server" config value -->
			<request>
				<http method="GET" url="/nha.txt" version="1.1"/>
			</request>
			<for from="1" to="10000" var="i">
			<!-- <for from="1" to="10000000" var="i"> -->
				<request>
					<!-- <http method="GET" url="/test.txt" version="1.1"/> -->
					<http method="GET" url="/" version="1.1"/>
				</request>
			</for>
			<!-- <request><http if_modified_since="Fri, 14 Nov 2003 02:43:31 GMT" method="GET" url="/images/accueil1.gif" version="1.1"/></request><request><http if_modified_since="Fri, 14 Nov 2003 02:43:31 GMT" method="GET" url="/images/accueil2.gif" version="1.1"/></request><request><http if_modified_since="Fri, 14 Nov 2003 02:43:31 GMT" method="GET" url="/images/accueil3.gif" version="1.1"/></request><thinktime random="true" value="20"/><request><http method="GET" url="/index.en.html" version="1.1"/></request>-->
		</session>
	</sessions>
</tsung>